AveryLouie/flashware/sdk 6.1/nrf51822/Board/Flash/s110/ble_app_proximity_beacon/main.c
//lfclk/RTC stuff
// #define LFCLK_FREQUENCY           (32768UL)                               /**< LFCLK frequency in Hertz, constant. */
// #define RTC_FREQUENCY             (8UL)                                   /**< Required RTC working clock RTC_FREQUENCY Hertz. Changable. */
// #define COMPARE_COUNTERTIME       (10UL)                                   /**< Get Compare event COMPARE_TIME seconds after the counter starts from 0. */
// #define COUNTER_PRESCALER         ((LFCLK_FREQUENCY / RTC_FREQUENCY) - 1)   /* f = LFCLK/(prescaler + 1) */

static ble_acc_t m_acc;          //accelerometer service ID structure
static app_timer_id_t acc_timer_id; //accelerometer timer
volatile uint16_t xyz[3];

// Persistent storage system event handler
void pstorage_sys_event_handler (uint32_t p_evt);

/**@brief Function for error handling, which is called when an error has occurred.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    nrf_gpio_pin_set(ASSERT_LED_PIN_NO);

    // This call can be used for debug purposes during application development.
    // @note CAUTION: Activating this code will write the stack to flash on an error.
    //                This function should NOT be used in a final product.
    //                It is intended STRICTLY for development/debugging purposes.
    //                The flash write will happen EVEN if the radio is active, thus interrupting
    //                any communication.
    //                Use with care. Un-comment the line below to use.
    // ble_debug_assert_handler(error_code, line_num, p_file_name);

    // On assert, the system can only recover with a reset.
    simple_uart_putstring((const uint8_t*) "app error\r\n");
    simple_uart_putstring(p_file_name);
    NVIC_SystemReset();
}


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
/*
// YOUR_JOB: Uncomment this function and make it handle error situations sent back to your
//           application by the services it uses.
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
} */

static void accel_timeout_handler(void* p_context)
{
    update_xyz(xyz);
    ble_acc_accel_level_update(&m_acc, xyz[1]);
    UNUSED_PARAMETER(p_context);
    simple_uart_putstring((const uint8_t*) "acc\r\n");
}


static void ext_sensors_init(void)
{
    simple_uart_putstring((const uint8_t*) "acc1\r\n");
    ACCEL_INIT();
    simple_uart_putstring((const uint8_t*) "acc2\r\n");
    //     while(reg_write_ver(CTRL_REG1, 0x97)!=1){
    //     simple_uart_putstring((const uint8_t*)"retrying cr1 tx\r\n");
    // }//0b10010111//0b01110111
    // nrf_delay_ms(10);
    // top = reg_read(CTRL_REG1);
    // simple_uart_putstring((const uint8_t *)"\r\ncr1 ");
    // uart_put_decbyte(top);

    // while(reg_write_ver(CTRL_REG2, 0x80)!=1){
    //     simple_uart_putstring((const uint8_t*)"retrying cr2 tx\r\n");
    // }//10000000
    // nrf_delay_ms(10);
    // top = reg_read(CTRL_REG2);
    // simple_uart_putstring((const uint8_t *)"\r\ncr2 ");
    // uart_put_decbyte(top);

    // nrf_delay_ms(10);
    // top = reg_read(CTRL_REG3);
    // simple_uart_putstring((const uint8_t *)"\r\ncr3 ");
    // uart_put_decbyte(top);

    // while(reg_write_ver(CTRL_REG4, 0x08)!=1){
    //     simple_uart_putstring((const uint8_t*)"retrying cr4 tx\r\n");
    // }//0b00000000
    // nrf_delay_ms(10);
    // top = reg_read(CTRL_REG4);
    // simple_uart_putstring((const uint8_t *)"\r\ncr4 ");
    // uart_put_decbyte(top);

    // nrf_delay_ms(10);
    // top = reg_read(CTRL_REG5);
    // simple_uart_putstring((const uint8_t *)"\r\ncr5 ");
    // uart_put_decbyte(top);

    // nrf_delay_ms(10);
    // top = reg_read(CTRL_REG6);
    // simple_uart_putstring((const uint8_t *)"\r\ncr6 ");
    // uart_put_decbyte(top);

    accel_timeout_handler(NULL);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    nrf_gpio_cfg_output(ADVERTISING_LED_PIN_NO);
    nrf_gpio_cfg_output(CONNECTED_LED_PIN_NO);
    nrf_gpio_cfg_output(ASSERT_LED_PIN_NO);

    // YOUR_JOB: Add additional LED initialiazations if needed.
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
    err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
    APP_ERROR_CHECK(err_code); */

